tsung-security-buyer/simple.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="localhost" use_controller_vm="true" maxusers="15000"/>
  </clients>

  <servers>
   <server host="54.86.172.236" port="80" type="tcp"/>
  </servers>


  <load>
    <arrivalphase phase="1" duration="300" unit="second">
      <users arrivalrate="1" unit="second"/>
    </arrivalphase> 
  </load>

  <options>
    <option name="global_ack_timeout" value="2000"/>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
  
    <session name="store_index" probability="100" type="ts_http">
	    <request>
        <http url="/" version="1.1" method="GET"/>
      </request>
      <thinktime value="1" random="true"/>
	  
      <request>
        <http url="/buyers/sign_in" version="1.1" method="GET"/>
      </request>
      <thinktime value="2" random="true"/>

      <setdynvars sourcetype="random_number" start="1" end="500">
        <var name="username"/>
      </setdynvars>
	    <setdynvars sourcetype="random_number" start="1" end="20">
        <var name="provider"/>
      </setdynvars>
      <request subst="true">
        <http url="/buyers/sign_in" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;authenticity_token=s99JUTXvAcqc52kIDgRWCd1HSo0H%2F3cADCdQ7xIxeJZQuVRRS%2BKduVCUX1kOasSpPA9tPaJ6dDbFxGpc44sc5A%3D%3D&amp;buyer%5Bemail%5D=%%_username%%%40%%_provider%%.com&amp;buyer%5Bpassword%5D=12345678&amp;buyer%5Bremember_me%5D=0&amp;commit=Log+in">
        </http>
      </request>
	    <thinktime value="2" random="true"/>
	  
	    <setdynvars sourcetype="random_number" start="1" end="217">
        <var name="random_page"/>
      </setdynvars>
	    <request subst="true">
        <http url="/store/index?page=%%_random_page%%" version="1.1" method="GET"/>
      </request>
	    <thinktime value="2" random="true"/>
 	  
      <setdynvars sourcetype="random_number" start="1" end="4327">
        <var name="random_product"/>
      </setdynvars>
      <request subst="true">
        <http url="/line_items?line_item%5Bproduct_id%5D=%%_random_product%%&amp;line_item%5Bquantity%5D=1" version="1.1" method="POST" contents="product_id=%%_random_product%%&amp;quantity=1&amp;commit=Add+to+Cart">
        </http>
      </request>
  	  <thinktime value="2" random="true"/>
	  
      <setdynvars sourcetype="random_string" length="13">
        <var name="random_name"/>
      </setdynvars>
  	  <setdynvars sourcetype="random_string" length="50">
        <var name="random_address"/>
      </setdynvars>
      <request subst="true">
        <http url="/orders/new" version="1.1" method="GET"/>
      </request>
	  
      <request subst="true">
        <http url="/orders" version="1.1" method="POST" contents="utf8=%E2%9C%93&amp;order%5Bname%5D=%%_random_name%%&amp;order%5Baddress%5D=%%_random_address%%&amp;order%5Bemail%5D=%%_username%%%40%%_provider%%.com&amp;order%5Bpay_type%5D=Check&amp;commit=Place+Order">
        </http>
      </request>
    </session>

  </sessions>


</tsung>